Repository: erkinov-2003/note_app
Catalog: lib/src/common/localization/intl_*.arb
Languages: uz

source: Theme
uz: Mavzu

source: Theme App
uz: Ilova mavzusi

source: Language APP
uz: Ilova tili

source: Next
uz: Keyingi

source: Sign In
uz: Tizimga kirish

source: Sign Up
uz: Ro'yxatdan o'tish

# signInTitle
source: Welcome to back Your NOTE...
uz: Eslatmangizga xush kelibsiz...

# signUpTitle
source: Your NOTE is here...
uz: Sizning eslatmangiz bu yerda...

source: Forgot password?
uz: Parolni unutdingizmi?

source: Full Name
uz: To'liq ism

source: Email address
uz: Elektron pochta manzili

source: Password
uz: Parol

source: Enter email address
uz: Elektron pochta manzilini kiriting

source: Set Password
uz: Parolni o'rnating

source: Delete
uz: O'chirish

source: Add Password
uz: Parol qo'shish

source: Back
uz: Ortga

source: Log In
uz: Kirish

source: Register
uz: Ro'yxatdan o'tish

source: Open Gallery
uz: Galareyani ochish

source: Open Camera
uz: Kamerani ochish

source: Add Photo
uz: Fotosurat qo'shing

source: Profile
uz: Profil

source: Your Name
uz: Sizning ismingiz

# secretPassword
source: Secret note Password
uz: Maxfiy eslatma uchun parol

source: Log Out
uz: Tizimdan chiqish

source: Language
uz: Til

source: Profile Image
uz: Profil rasmi

source: New Note
uz: Yangi eslatma

# updateSecretPass
source: Update your secret Notes password
uz: Maxfiy parolinni yangilash

# newSecretPass
source: Create your secret Notes password
uz: Yangi maxfiy parol yaratish

source: Check
uz: Tekshirish

# setPassword2
source: Set new password
uz: Yangi parolni o'rnatish

# oldPassword
source: Your old password
uz: Eski parol

# passwordLength
source: Password is too short, it must be at least 8 characters
uz: Parol juda qisqa, u kamida 8 ta belgidan iborat bo ªlishi kerak

# passwordSpace
source: Password shouldn't have space
uz: Parolda bo'sh joy bo'lmasligi kerak

# passwordNumber
source: Password must have at least one number
uz: Parolda kamida bitta raqam bo'lishi kerak

# passwordLetter
source: Password must have at least one letter
uz: Parol kamida kichik bitta harfdan iborat bo'lishi kerak

# passwordCapitalLetter
source: Password must have at least one Capital letter
uz: Parolda kamida bitta katta harf bo'lishi kerak

# invalidEmail
source: Invalid email address!
uz: Elektron pochta manzili yaroqsiz!

# alreadyRegister
source: You are already Registered
uz: Siz allaqachon ro'yxatdan o'tgansiz

source: Invalid name!
uz: Ism noto'g'ri!

source: Wrong password
uz: Noto'g'ri parol

source: Sign in with
uz: Tizimga kirish

source: Text with link
uz: Havola bilan matn

source: Cancel
uz: Bekor qilish

source: Add Link
uz: Link qo'shish

# didNotPicture
source: User didn't take any picture.
uz: Foydalanuvchi hech qanday rasmga tushmadi.

# didNotImage
source: User didn't take any image.
uz: Foydalanuvchi hech qanday rasm olmadi.

# enterTitle
source: Enter title of note...
uz: Eslatma nomini kiriting...

# bodyText
source: This is where your note will be. It’ll be housed here. You’ll save your note here. Type your memories here. Write down your thoughts.
uz: Bu sizning eslatmangiz bo'ladi. Bu yerda joylashtiriladi. Eslatmani shu yerda saqlaysiz. Xotiralaringizni shu yerga yozing. Fikrlaringizni yozib qoldiring.

# checkPasswordAgain
source: Please check the password again
uz: Parolni qaytadan tekshiring

source: Your email address
uz: Sizning e-pochta manzilingiz

source: Enter new password
uz: Yangi parolni kiriting

source: Enter again
uz: Qaytadan kiriting

source: Enter
uz: Kiriting

source: Send code
uz: Kodni yuborish

# incorrectlyPassword
source: You entered the password incorrectly
uz: Noto'g'ri parol kiritdingiz

source: Enter password
uz: Parolni kiriting

source: Could not launch
uz: Ishga tushirilmadi

# enjoyNote
source: Enjoy note taking with friends
uz: Do'stlaringiz bilan eslatma olishdan zavqlaning

source: Save
uz: Saqlash

source: Change Your name
uz: Ismni o'zgartirish

# snackBar
source: Please fill all fields.
uz: Iltimos, barcha maydonlarni to'ldiring.

# snackBar2
source: Incorrect password. Please try again.
uz: Noto'g'ri parol. Iltimos, yana bir bor urinib ko'ring.

# snackBar3
source: Please enter a 4-digit new password.
uz: Iltimos, yangi 4 xonali parolni kiriting.
